# EnergyAnalysisMaterial Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisMaterial Class
Members See Also
---
A description of a material with thermal properties in a composite construction.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class EnergyAnalysisMaterial : Element
```

Visual Basic
---
```text
Public Class EnergyAnalysisMaterial _
	Inherits Element
```

Visual C++
---
```text
public ref class EnergyAnalysisMaterial : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Analysis..::..EnergyAnalysisMaterial
# See Also
EnergyAnalysisMaterial Members
Autodesk.Revit.DB.Analysis Namespace